<template>
  <div class="dis-container drop" style="padding:1rem">
    <header>
      <div class="head-bk">精弘毅行</div>
    </header>
    <div class="d-content">
      <h1>报名须知</h1>
      <p>请仔细阅读本活动须知。因违反毅行规则而产生的一切后果需要自行承担，组织方概不负责</p>
      <h2>【温馨提示】</h2>
      <p>1. <b>绿水青山就是金山银山</b>，毅行途中请保护环境，关爱地球母亲；</p>
      <p>2. 由于屏峰毅行线路特殊性，线路沿途产生的垃圾需要工作人员徒手携带下山，我们倡议:<b>垃圾不落地，环境更美丽。参加屏峰毅行自备垃圾袋，将自己产生的垃圾一起携带下山，不要让垃圾独自留在山上；</b></p>
      <p>3. 屏峰毅行路线建议根据自身情况携带<b>1.5L左右饮用水</b>以及牛肉棒等高能量食物补充；</p>
      <p>4. 本活动<b>不提供中饭</b>，请参与者自行携带食物。</p>

      <h2>【报名须知】</h2>
      <p>1. 本次精弘毅共五条路线：屏峰路线（半程、全程）、朝晖路线、莫干山路线（半程、全程）；</p>
      <p>2. 屏峰全程路线较长，地形起伏大，部分路段陡峭，<b>体力消耗较大</b>，参与者选择时<b>务必慎重考虑、量力而行</b>，建议第一次参加屏峰毅行的同学选择半程路线，并与有经验的参与者一同组队；</p>
      <p>3. 罹患高血压、心脏病、骨质疏松等疾病患者不可以参加本次活动，为了您自身的健康与安全，建议选择其他更加休闲的健身锻炼方式；</p>
      <p>4. 报名后务必关注“浙江工业大学精弘网络”与“精小弘在线”微信公众号以便及时接收活动通知，并注意查收手机短信；</p>
      <p>5. 需要先填写个人信息注册，<b>组队4~6人成功提交队伍信息才视为成功报名</b>，如需增删改队员，需要取消后重新提交；</p>
      <p>6. 报名后请务必按照通知的时间准时到达出发点，不要在其他时间段出发，以免因人数过多而造成道路堵塞；</p>
      <p>7. 请在线上完成信息注册和组队提交报名，线下仅提供咨询答疑服务，即不提供现场报名；</p>
      <p>8. 由于活动<b>人数限制</b>，各条路线<b>报满即止</b>，将在每日上午二点更新名额。</p>

      <h2>【风险告知】</h2>
      <p>1、关注活动期间的天气情况，做好<b>防晒、防雨、防寒</b>的准备；</p>
      <p>2、一切听从组织的安排，以小组为单位参加活动，<b>安全优先</b>，遵守活动纪律；</p>
      <p>3、提前学习如何避免和处理运动损伤，如水泡、抽筋、崴脚等；</p>
      <p>4. 偏僻线段多人结伴同行，勿落单，屏峰毅行路线大部分位于山区，部分路段存在手机信号弱的情况，为了您的安全，<b>请勿尝试规划路线以外的小路</b>，有任何问题可以询问精弘网络工作人员以及北风护航队员；</p>
      <p>5、心血管、脑血管、高血压、低血糖、关节炎等有身体健康问题或有突发病史者，不适宜强烈运动。</p>
      <h2>【免责声明】</h2>
      <p>1、本活动是<b>非商业性</b>的长距离登山徒步自发群体活动，有一定的风险，参加者应根据自身的状况作出是否参加活动的决定，并应<b>对自己的安全负完全责任</b>。未成年人必须经监护人同意并由其监护人陪同参加；</p>
      <p>2、活动参与者保证已熟知并同意本次活动的所有行程与活动安排，充分了解毅行活动的潜在风险，愿意独立承担本次活动中可能发生的人身或财产损害；</p>
      <p>3、活动参与者在活动过程中将根据自身身体状况，独立判断行动风险以保障自身人身和财产安全，不受任何活动参加者及其他成员的影响，并有权随时中途退出活动；</p>
      <p>4、参加活动往返交通途中和活动中如果发生意外事故，组织者会尽能力范围内组织救援，但对于事故造成的身体损害，乃至不可逆转的永久性身体损伤、后遗症等，以及事件伴随的经济损失，活动组织者不承担任何法律和经济责任；</p>
      <p>5、一旦报名，即视为参加者（包括代他人报名者，被代报名参加者）已经充分了解并自愿接受本免责条款，本免责条款自动生效。否则，请终止报名参加，已报名的参加者请在活动开始前退出本次活动；</p>
      <p>
        6、请按规定路线前进，否则出现问题精弘网络概不负责；凡报名参加者均视为具有完全民事行为能力人，如在活动中发生人身损害后果，赔偿责任领队或召集人不承担，由受损害人依据法律规定和本领队或召集人声明依法解决，凡报名者均视为接受本领队或召集人声明；</p>
      <p>7、<b>本条款同样适用于活动各环节工作人员及志愿者。</b></p>
      <h2>【安全须知】</h2>
      <p>1.身体不适者请及时在指定位置下撤终止毅行或就近选择安全地点等待工作人员救助；</p>
      <p>2.如果队伍中有人受伤需要立即联系身边最近的工作人员，原地等待医务人员救治，不要随意移动以免二次受伤；</p>
      <p>3.<b>禁止吸烟、明火，以防山火；</b></p>
      <p>4.全程较长，请合理估计自己的身体状况，合理选择全程线或半程线路，如果发生体力不支等意外情况请及时联系工作人员下山，<b>切勿逞能，以防发生危险</b>。</p>
      <h2>【出发&行进&打卡须知】</h2>
      <p>1. <b>携带身份证</b>，出发与到达均需要确认身份信息；</p>
      <p>2. 团队内需要互相配合，互帮互助，请不要走散；</p>
      <p>3. 队伍全部人员到齐之后才可以在打卡点打卡；</p>
      <p>4. <b>每条路线每个打卡点都有关门时间，到达关门时间后不得前进</b>，屏峰毅行路线需就近从下撤点直接下山；</p>
      <p>5. 不在规定出发时间出发的团队将不提供打卡单；</p>
      <p>6. <b>妥善保存打卡单</b>，最终结果以打卡单为准；</p>
      <p>7. 路线行至陡坡需有序通过；</p>
      <p>8. 毅行的过程当中，请不要长时间逗留，以免造成堵塞；</p>
      <p>9. 毅行途中请尽量避免与他人发生冲突，毅行不易，且行且珍惜。必要时请联系工作人员解决。</p>

      <h2>【小贴士】</h2>
      <p>1. 行程较长，请自行携带足够的水及一定的高热量食物补充能量；</p>
      <p>2. 请穿着适当的衣服，避免山间行径时树枝划破皮肤，也可准备保暖衣物以防山上气温较低感冒着凉；</p>
      <p>3. 出发前请查看天气预报，自备雨伞或雨衣，提前准备防晒工作；</p>
      <p>4. 建议随身携带充电宝，保证手机有电，通讯畅通；</p>
      <p>5. 屏峰毅行路线大部分为崎岖山路，参与者应选择合适的着装和鞋履，建议使用双肩包，可自行准备登山杖以及护膝以减少运动损伤；</p>
      <p>6. 三校区之间开放路线选择，请根据自身情况选择并且注意跨校区所产生的交通和住宿等问题；</p>
      <p>7. 毅行是一个团队协作的活动，请和队员以及其他团队之间互帮互助，团结合作；</p>
      <p>8. 在某些狭小或者较危险的路段注意谦让，不要争抢。 </p>
      <h2>最终解释权归精弘网络所有。</h2>
    </div>
    <v-layout justify-center style="margin-bottom:1rem;" v-if="agreeable">
      <v-dialog max-width="290" persistent v-model="dialog">
        <template v-slot:activator="{ on }">
          <v-btn color="primary" @click="showDialog" style="margin-bottom: 1rem;">{{ timeOut > 0 ? timeOut : '同意' }}
          </v-btn>
        </template>
        <v-card>
          <v-card-title class="headline">是否同意声明</v-card-title>
          <v-card-text>确定你已经阅读该《风险告知与免责声明》并且同意本声明</v-card-text>
          <v-card-actions>
            <v-spacer></v-spacer>
            <v-btn color="green darken-1" text @click="showDialog">不同意</v-btn>
            <v-btn color="green darken-1" text @click="agree">同意</v-btn>
          </v-card-actions>
        </v-card>
      </v-dialog>
    </v-layout>
  </div>
</template>
<script lang="ts">
import {Component, Vue, Emit, Prop} from "vue-property-decorator";

@Component
export default class Disclaimer extends Vue {
  private dialog = false;

  @Prop({type: Number, default: 30})
  private timeOut: number = 30;

  @Prop({type: Boolean, default: true})
  private agreeable?: boolean;

  @Emit()
  private agree() {
    this.dialog = false;
  }

  private showDialog() {
    if (this.timeOut === 0 && this.dialog === false) {
      this.dialog = true;
    } else {
      this.dialog = false;
    }
  }

  private mounted() {
    (this.timeOut as number)--;
    const clock = window.setInterval(() => {
      (this.timeOut as number)--;
      if (this.timeOut < 0) {
        window.clearInterval(clock);
        this.timeOut = 0;
      }
    }, 1000);
  }
}
</script>
<style scoped>
p{
  text-align: left;
}
</style>
